# At the beginning
MARKINGS = ['ˈ', 'ˌ', '.']

# initial glottal stop mutation
FRONT_VOWELS = ['iː', 'i', 'ĩː', 'ĩ', 'ɛː', 'ɛ', 'eː', 'e', 'æː', 'æ']
# unreleased stop mutation
STOP_CONS = ['p', 'b', 't', 'd', 'ʈ', 'ɖ', 'k', 'g',
             'q', 'ɢ', 't͡ʃ', 'd͡ʒ', 't͡θ', 'd͡z']
GEMINATE_STOP = {'t͡ʃ': 't', 'd͡ʒ': 'd', 't͡θ': 't', 'd͡z': 'd'}
AFFRICATISE = {'s': 't͡s', 'z': 'd͡z', 'ʂ': 'ʈ͡ʂ', 'ʐ': 'ɖ͡ʐ', 
               'ç': 't͡ʃ', 'ʝ': 'd͡ʒ', 'ɬ': 't͡ɬ'}
PREFRICATE = {'s': 't', 'z': 'd', 'ʂ': 'ʈ', 'ʐ': 'ɖ', 
              'ç': 't', 'ʝ': 'd', 'ɬ': 't'}
NASALISE_STOP = {
    'p': 'm̥', 'b': 'm', 't': 'n̥', 'd': 'n',
    'ʈ': 'ɳ̊', 'ɖ': 'ɳ', 'k': 'ŋ̊', 'g': 'ŋ',
    'q': 'ɴ̥', 'ɢ': 'ɴ'
}
# geminate nasal stopping
GEMINATE_NASAL = {
    'm̥': ('m̥', 'p'), 'm': ('m', 'b'),
    'n̥': ('n̥', 't'), 'n': ('n', 'd'),
    'ɳ̊': ('ɳ̊', 'ʈ'), 'ɳ': ('ɳ', 'ɖ'),
    'k': ('ŋ̊', 'k'), 'g': ('ŋ', 'g'),
    'q': ('ɴ', 'ɢ'), 'ɢ': ('ɴ', 'ɢ')
}
# fricative opening/vocalisation
VOWELS = [
    'a', 'aː', 'ɐ', 'ɐː', 'ɐ̃ː', 'ɐ̃', 'ɑ', 'ɑː', 'æ', 'æː',
    'ɐɪ̯', 'ɐɔ̯', 'ɐʊ̯', 'ɐʊ̯̃', 'ɑɛ̯',
    'e', 'eː','ɛ', 'ɛː', 'ɛɐ̯', 'ɜ', 'ɜː', 'ɘː',
    'i', 'iɐ̯̃', 'iɐ̯', 'iː', 'ĩ', 'ĩː', 'ɨ', 'ɨː', 'ɨ̃', 'ɨ̃ː',
    'o', 'oː', 'ɔ', 'ɔɐ̯', 'ɔː', 
    'u', 'uɐ̯̃', 'uɐ̯', 'uː', 'ũ', 'ũː', 
    'ʊ', 'ɪ', 'ʌ', # this line of vowels only introduced here though
] 
VOCALISE_CCC_FRIC = {'v': 'ʊ', 'w': 'ʊ', 'l': 'ʊ',
                    'ʐ': 'ʌ', 'j': 'ɪ', 'ʝ': 'ɪ'}
OFFGLIDE_VC_FRIC = {'v': 'ʊ̯', 'w': 'ʊ̯', 'l': 'ʊ̯', 'j': 'ɪ̯', 'ʝ': 'ɪ̯'}
DISALLOW_OFFGLIDE_BACK = ['u', 'uː', 'ũ', 'ũː', 'ʊ']
DISALLOW_OFFGLIDE_FRONT = ['i', 'iː', 'ĩ', 'ĩː', 'ɪ']
DISALLOW_OFFGLIDE = {'v': DISALLOW_OFFGLIDE_BACK,
                     'w': DISALLOW_OFFGLIDE_BACK,
                     'l': DISALLOW_OFFGLIDE_BACK,
                     'j': DISALLOW_OFFGLIDE_FRONT,
                     'ʝ': DISALLOW_OFFGLIDE_FRONT}
BACK_ELIDES = ['v', 'w']
FRONT_ELIDES = ['j', 'ʝ']
ELIDE_BACK_FRIC = ['uɐ̯̃', 'uɐ̯', 'u', 'uː', 'ũ', 'ũː']
ELIDE_FRONT_FRIC = ['i', 'iɐ̯̃', 'iɐ̯', 'iː', 'ĩ', 'ĩː']
APPROXIMISE_FRIC = {'v': 'ʋ', 'w': 'ʋ', 'ʐ': 'ɹ', 'ʝ': 'j'}

# The Great Place Shift
RETROFLEX_PLACE_SHIFT = {'ʈ': 't', 'ɖ': 'd', 'ɳ̊': 'n̥', 'ɳ': 'n',
                         'ɭ': 'l', 'ɭ̥': 'r̥', 'ʂ': 's',
                         'ʈ͡ʂ': 't͡ʃ', 'ɖ͡ʐ': 'd͡ʒ'}
ALVEOLAR_PLACE_SHIFT = {'t': 'c', 'd': 'ɟ', 'n̥': 'ɲ̊', 'n': 'ɲ',
                        't͡s': 'c͡ɕ', 'd͡z': 'ɟ͡ʑ', 't͡ɬ': 'c͡ɕ', 
                        'l': 'ʎ', 'ɬ': 'ɕ', 's': 'ɕ', 'z': 'ʑ'}
ALVEOLAR_SHIFT_BLOCKS = {'ʋ': '', 'f': 'ħ', 'ʊ': 'ʊ', 't͡θ': 'f', 'd͡ð': 'ʋ',
                         'u': 'u', 'uɐ̯̃': 'uɐ̯̃', 'uɐ̯': 'uɐ̯',
                         'uː': 'uː', 'ũ': 'ũ', 'ũː': 'ũː',
                         'ɢ': 'ɢ', 'ɴ̥': 'ɴ̥', 'ɴ': 'ɴ', 'ħ': 'ħ'}
PALATAL_BLOCKS = ['t͡ɬ', 'ɬ']
PALATAL_TRIGGERS = ['t͡ʃ', 'd͡ʒ', 'ç']
PALATAL_PLACE_SHIFT = {'t͡ʃ': 'k', 'd͡ʒ': 'g', 'ç': 'x', 'j': 'ɣ',
                       't': 'k', 'd': 'g', 'n̥': 'ɴ̥', 'n': 'ɴ',
                       'l': 'l', 's': 's', 'z': 'z'}
VELAR_NASAL_SHIFT = {'ŋ̊': 'ɴ̥', 'ŋ': 'ɴ'}
RHOTS = ['r', 'r̥']

PLACESHIFT_CLEANUP = {
    'ç': 'j', 'ɬ': 'ɕ'
}

# Cluster Reduction
STOPS_TO_DELETE = {'p': '', 'b': '', 'c': '', 'ɟ': '',
                   'c͡ɕ': 'ɕ', 'ɟ͡ʑ': 'ʑ', 'k': '', 'g': '', 'ɢ': ''}
STOPS_TO_AFFRICATISE = ['p', 'b', 't', 'd', 't͡ʃ', 'd͡ʒ', 'c', 'ɟ',
                        'c͡ɕ', 'ɟ͡ʑ', 'k', 'g', 'ɢ']
PALS_TO_DECLUSTER = ['c', 'ɟ', 'ɲ̊', 'ɲ', 'ʎ']
VULS_TO_DECLUSTER = ['k', 'g', 'ɢ', 'ɴ̥', 'ɴ', 'x', 'ɣ', 'ʀ̥', 'ʀ']
TRILLS_TO_COMPENSATE = ['r', 'r̥', 'ʀ̥', 'ʀ']

# Hiatus Reduction
ALL_VOWELS = (list(VOWELS) +
              [x + 'ʊ̯' for x in VOWELS] +
              [x + 'ɪ̯' for x in VOWELS])

NJ_NASALS = {
    'ĩ': 'i',
    'ĩː': 'iː',
    'ũːɪ̯': 'uːɪ̯',
    'ũɪ̯': 'uɪ̯',
    'ɐ̃ːɪ̯': 'ɐːɪ̯',
    'ɐ̃ɪ̯': 'ɐɪ̯',
}
N_NASALS = {
    'ɨ̃': 'ɨ',
    'ɨ̃ː': 'ɨː',
    'ɨ̃ɪ̯': 'ɨɪ̯',
    'ɨ̃ːɪ̯': 'ɨːɪ̯',
    'ɨ̃ʊ̯': 'ɨʊ̯',
    'ɨ̃ːʊ̯': 'ɨːʊ̯',
}
NG_NASALS = {
    'ɐ̃ː': 'ɐː',
    'ɐ̃': 'ɐ',
    'iɐ̯̃': 'iɐ̯',
    'uɐ̯̃': 'uɐ̯',
}
M_NASALS = {
    'ɐʊ̯̃': 'ɐʊ̯',
    'ũː': 'uː',
    'ũ': 'u',
    'ĩʊ̯': 'iʊ̯',
    'ĩːʊ̯': 'iːʊ̯',
    'ɐ̃ːʊ̯': 'ɐːʊ̯',
    'ɐ̃ʊ̯': 'ɐʊ̯',
}

NASAL_VOWELS = list(NJ_NASALS.keys()) + list(N_NASALS.keys()) + list(NG_NASALS.keys()) + list(M_NASALS.keys())

# Great Vowel Shift

ABS_ALL_VOWELS = [
    'a', 'aː', 'ɐ', 'ɐː', 'ɐ̃ː', 'ɐ̃', 'ɑ', 'ɑː', 'æ', 'æː',
    'ɐɔ̯', 'ɐʊ̯̃', 'ɑɛ̯', 'ʌ', 
    'e', 'eː', 'ɛ', 'ɛː', 'ɛɐ̯', 'ɜ', 'ɜː', 'ɘː',
    'i', 'iɐ̯̃', 'iɐ̯', 'iː', 'ĩ', 'ĩː', 'ɨ', 'ɨː', 'ɨ̃', 'ɨ̃ː', 'ɪ',
    'o', 'oː', 'ɔ', 'ɔɐ̯', 'ɔː', 
    'u', 'uɐ̯̃', 'uɐ̯', 'uː', 'ũ', 'ũː', 'ʊ',

    'aɪ̯', 'aːɪ̯', 'ɐɪ̯', 'ɐːɪ̯', 'ɐ̃ːɪ̯', 'ɐ̃ɪ̯', 'ɑɪ̯', 'ɑːɪ̯', 'æɪ̯', 'æːɪ̯', 'ʌɪ̯', 
    'eɪ̯', 'eːɪ̯', 'ɛɪ̯', 'ɛːɪ̯', 'ɜɪ̯', 'ɜːɪ̯', 'ɘːɪ̯',
    'ɨɪ̯', 'ɨːɪ̯', 'ɨ̃ɪ̯', 'ɨ̃ːɪ̯',
    'oɪ̯', 'oːɪ̯', 'ɔɪ̯', 'ɔːɪ̯', 
    'uɪ̯', 'uːɪ̯', 'ũɪ̯', 'ũːɪ̯', 'ʊɪ̯',

    'aʊ̯', 'aːʊ̯', 'ɐʊ̯', 'ɐːʊ̯', 'ɐ̃ːʊ̯', 'ɐ̃ʊ̯', 'ɑʊ̯', 'ɑːʊ̯', 'æʊ̯', 'æːʊ̯', 'ʌʊ̯', 
    'eʊ̯', 'eːʊ̯', 'ɛʊ̯', 'ɛːʊ̯', 'ɜʊ̯', 'ɜːʊ̯', 'ɘːʊ̯',
    'iʊ̯', 'iːʊ̯', 'ĩʊ̯', 'ĩːʊ̯', 'ɨʊ̯', 'ɨːʊ̯', 'ɨ̃ʊ̯', 'ɨ̃ːʊ̯', 'ɪʊ̯',
    'oʊ̯', 'oːʊ̯', 'ɔʊ̯', 'ɔːʊ̯', 
] 

BACK_VOWELS = [
    'ɑ', 'ɑː', 'ɑɛ̯', 'ɑɪ̯', 'ɑːɪ̯', 'ɑʊ̯', 'ɑːʊ̯', 
    'o', 'oː', 'ɔ', 'ɔɐ̯', 'ɔː', 'ɔ̃', 'oɐ̯', 'oɐ̯̃',
    'ou̯', 'oũ̯', 'ɤ', 'ɤː',
    'u', 'uɐ̯̃', 'uɐ̯', 'uː', 'ũ', 'ũː', 'ʊ', 'uo̯', 
    'oɪ̯', 'oːɪ̯', 'ɔɪ̯', 'ɔːɪ̯', 
    'uɪ̯', 'uːɪ̯', 'ũɪ̯', 'ũːɪ̯', 'ʊɪ̯',
    'oʊ̯', 'oːʊ̯', 'ɔʊ̯', 'ɔːʊ̯', 
    'ɑe̯', 'ɤɪ̯', 'ɤɪ̯̃', 'uɪ̯̃', 'ʌ', 
]
CENTRAL_VOWELS = [
    'a', 'aː', 'ɐ', 'ɐː', 'ɐ̃ː', 'ɐ̃', 'ɐɔ̯', 'ɐʊ̯̃', 
    'aɪ̯', 'aːɪ̯', 'ɐɪ̯', 'ɐːɪ̯', 'ɐ̃ːɪ̯', 'ɐ̃ɪ̯', 'ʌɪ̯', 
    'aʊ̯', 'aːʊ̯', 'ɐʊ̯', 'ɐːʊ̯', 'ɐ̃ːʊ̯', 'ɐ̃ʊ̯', 'ʌʊ̯', 
    'ɜ', 'ɜː', 'ɘː', 'ɜɪ̯', 'ɜːɪ̯', 'ɘːɪ̯', 'ɜʊ̯', 'ɜːʊ̯', 'ɘːʊ̯',
    'ɨ', 'ɨː', 'ɨ̃', 'ɨ̃ː',
    'ɨɪ̯', 'ɨːɪ̯', 'ɨ̃ɪ̯', 'ɨ̃ːɪ̯',
    'ɨʊ̯', 'ɨːʊ̯', 'ɨ̃ʊ̯', 'ɨ̃ːʊ̯', 
]
FRONT_VOWELS = [
    'æ', 'æː', 'æɪ̯', 'æːɪ̯', 'æʊ̯', 'æːʊ̯', 
    'æo̯', 'øʊ̯', 'øʊ̯̃', 'ø',
    'e', 'eː', 'ɛ', 'ɛː', 'ɛɐ̯', 'ei̯', 'eĩ̯', 'ɛ̃', 'eɐ̯', 'eɐ̯̃', 
    'i', 'iɐ̯̃', 'iɐ̯', 'iː', 'ĩ', 'ĩː', 'ɪ', 'ie̯', 
    'eɪ̯', 'eːɪ̯', 'ɛɪ̯', 'ɛːɪ̯', 
    'eʊ̯', 'eːʊ̯', 'ɛʊ̯', 'ɛːʊ̯', 
    'iʊ̯', 'iːʊ̯', 'ĩʊ̯', 'ĩːʊ̯', 'ɪʊ̯',
    'y', 'yː', 'ỹ', 'ỹː',
]

NO_SHIFT = [
    'æɪ̯',
    'ɛ', 'ɔ', 'ʌ', 
    'eː', 'oː',
    'e', 'æ', 'o',
]
STR_NO_SHIFT = [
    'i', 'ĩ', 'ĩː',
    'u', 'ũ', 'ũː', 'uɪ̯', 
]
NO_SHIFT_BEFORE_HIATUS = [
    'iː', 'uː', 'ɛː', 'ɔː',
]
UNS_NO_SHIFT = []
BOTH_INF_SHIFT = {
    'ɐ': ['ɛ', 'ɔ'], 'ɐː': ['eɐ̯', 'oɐ̯'],
    'ɐ̃': ['ɛ̃', 'ɔ̃'], 'ɐ̃ː': ['eɐ̯̃', 'oɐ̯̃'], 
    'ɐɪ̯': ['æɪ̯', 'ɑe̯'], 'ɐːɪ̯': ['ei̯', 'ɤɪ̯'],
    'ɐ̃ɪ̯': ['eĩ̯', 'ɤɪ̯̃'], 'ɐ̃ːɪ̯': ['eĩ̯', 'ɤɪ̯̃'],
    'ʌɪ̯': ['æɪ̯', 'ɑe̯'], 'ʌʊ̯': ['æo̯', 'ɑʊ̯'],
    'ɐɔ̯': ['æo̯', 'ɑʊ̯'], 'ɐʊ̯̃': ['øʊ̯̃', 'oũ̯'], 
    'ɐʊ̯': ['æo̯', 'ɑʊ̯'], 'ɐːʊ̯': ['øʊ̯', 'ou̯'],
    'ɐ̃ʊ̯': ['øʊ̯̃', 'oũ̯'], 'ɐ̃ːʊ̯': ['øʊ̯̃', 'oũ̯'],
    'ɜ': ['ɛ', 'ʌ'], 'ɜː': ['eɐ̯', 'ɑe̯'],
    'ɜɪ̯': ['æɪ̯', 'ɤɪ̯'], 'ɜːɪ̯': ['ei̯', 'ɤɪ̯'],
    'ɜʊ̯': ['øʊ̯', 'ɑʊ̯'], 'ɜːʊ̯': ['øʊ̯', 'ou̯'],
    'ɘː': ['eː', 'ɤː'], 
    'ɘːɪ̯': ['ei̯', 'uɪ̯'], 'ɘːʊ̯': ['øʊ̯', 'ou̯'],
    'ɨ': ['e', 'u'], 'ɨː': ['ei̯', 'uo̯'],
    'ɨ̃': ['ɛ̃', 'ũ'], 'ɨ̃ː': ['eĩ̯', 'ũː'],
    'ɨɪ̯': ['ei̯', 'uɪ̯'], 'ɨːɪ̯': ['ei̯', 'uɪ̯'],
    'ɨ̃ɪ̯': ['eĩ̯', 'uɪ̯̃'], 'ɨ̃ːɪ̯': ['ei̯', 'uɪ̯'],
    'ɨʊ̯': ['y', 'u'], 'ɨːʊ̯': ['yː', 'uo̯'],
    'ɨ̃ʊ̯': ['ỹ', 'u'], 'ɨ̃ːʊ̯': ['ỹː', 'ũː'], 
    'ɔɪ̯': ['ɤɪ̯', 'ɑe̯'], 'ɔːɪ̯': ['ɤɪ̯', 'ɑe̯'], 
    'oɪ̯': ['ɤɪ̯', 'uɪ̯'], 'oːɪ̯': ['ɤɪ̯', 'uɪ̯'],
    'ɛʊ̯': ['æo̯', 'øʊ̯'], 'ɛːʊ̯': ['æo̯', 'øʊ̯'], 
    'eʊ̯': ['eː', 'øʊ̯'], 'eːʊ̯': ['eː', 'øʊ̯'],
}
UNS_INF_SHIFT = {
    'iʊ̯': ['y', 'ɤ'], 'iːʊ̯': ['yː', 'ɤː'],
    'ĩʊ̯': ['ỹ', 'ɤ'], 'ĩːʊ̯': ['ỹː', 'ũː'],
    'i': ['i', 'ɤ'], 'iː': ['iː', 'ɤː'],
    'ĩ': ['ĩ', 'ũ'], 'ĩː': ['ĩː', 'ũː'],
    'ɪ': ['e', 'ɤ'], 'ʊ': ['ø', 'o'],
    'ɪʊ̯': ['ø', 'ɤ'], 'ʊɪ̯': ['ø', 'ɤ'],
    'u': ['y', 'u'], 'uː': ['yː', 'uː'],
    'ũ': ['ỹ', 'ũ'], 'ũː': ['ỹː', 'ũː'],
    'uɪ̯': ['y', 'uɪ̯'], 'uːɪ̯': ['yː', 'uɪ̯'],
    'ũɪ̯': ['ỹ', 'uɪ̯̃'], 'ũːɪ̯': ['ỹː', 'uɪ̯̃'],
}
STR_INF_SHIFT = {
    'a': ['æ', 'ɔ'],
    'aː': ['æo̯', 'ɑe̯'], 
    'ɪ': ['i', 'ɤ'], 'ʊ': ['ø', 'u'],
    'ɪʊ̯': ['øʊ̯', 'ɤː'],'ʊɪ̯': ['ɤɪ̯', 'uɪ̯'],
}
STR_UNINF_SHIFT = {
    'æː': 'æɪ̯', 
    'ɛː': 'eɐ̯', 
    'ɛɪ̯': 'æɪ̯', 'ɛːɪ̯': 'æɪ̯', 
    'iː': 'ie̯', 'iɐ̯': 'eɐ̯', 'iɐ̯̃': 'eɐ̯̃',
    'iʊ̯': 'øʊ̯', 'iːʊ̯': 'yː',
    'ĩʊ̯': 'øʊ̯̃', 'ĩːʊ̯': 'ỹː',
    'ɔː': 'oɐ̯', 'ɔʊ̯': 'ɑʊ̯', 'ɔːʊ̯': 'ɑʊ̯', 
    'uː': 'uo̯', 'uɐ̯': 'oɐ̯', 'uɐ̯̃': 'oɐ̯̃',
    'uːɪ̯': 'uɪ̯', 'ũɪ̯': 'uɪ̯̃', 'ũːɪ̯': 'uɪ̯̃',
}
BOTH_UNINF_SHIFT = {
    'æːɪ̯': 'æɪ̯',
    'ɑ': 'ɔ', 'ɑː': 'ɔː',  
    'ɑɪ̯': 'ɑe̯', 'ɑːɪ̯': 'ɑe̯',
    'ɑʊ̯': 'ɑʊ̯', 'ɑːʊ̯': 'ɑʊ̯', 
    'aɪ̯': 'æɪ̯', 'aːɪ̯': 'æɪ̯', 
    'aʊ̯': 'ɑʊ̯', 'aːʊ̯': 'ɑʊ̯',
    'æʊ̯': 'æo̯', 'æːʊ̯': 'æo̯', 
    'ɑɛ̯': 'ɑe̯', 
    'ɛɐ̯': 'eɐ̯̃', 'ɔɐ̯': 'oɐ̯̃', 
    'eɪ̯': 'ei̯', 'eːɪ̯': 'ei̯',
    'oʊ̯': 'ou̯', 'oːʊ̯': 'ou̯',
}
UNS_UNINF_SHIFT = {
    'a': 'æ',
    'aː': 'ɔː', 'æː': 'ɛː', 
    'aʊ̯': 'ɔː', 'aːʊ̯': 'ɔː',
    'ɛː': 'ɛː', 'ɔː': 'ɔː', 
    'ɛɪ̯': 'ei̯', 'ɛːɪ̯': 'ei̯', 
    'i': 'e',
    'iɐ̯': 'e', 'iɐ̯̃': 'ĩ',
    'ɔʊ̯': 'ou̯', 'ɔːʊ̯': 'ou̯', 
    'u': 'o', 
    'uɐ̯': 'u', 'uɐ̯̃': 'ũ',
}
AFTER_SHIFT_VOWELS = [
    'æ', 'ʌ',
    'æɪ̯', 'ei̯', 'eĩ̯',
    'æo̯', 'øʊ̯', 'øʊ̯̃',
    'ɑʊ̯', 'ou̯', 'oũ̯',
    'ɑe̯', 'ɤɪ̯', 'ɤɪ̯̃', 'uɪ̯', 'uɪ̯̃',
    'ɛ', 'ɔ', 'ɛ̃', 'ɔ̃', 'ɛː', 'ɔː',
    'eɐ̯', 'oɐ̯', 'eɐ̯̃', 'oɐ̯̃',
    'e', 'eː', 'ɤ', 'ɤː',
    'o', 'oː', 'ø',
    'i', 'iː', 'ie̯', 'ĩ', 'ĩː',
    'u', 'uː', 'uo̯', 'ũ', 'ũː',
    'y', 'yː', 'ỹ', 'ỹː',
]
AFTER_GUT_VOWELS = AFTER_SHIFT_VOWELS + [
    'a', 'æɪ̯̃', 'æõ̯', 'ɑʊ̯̃', 'ɑẽ̯', 
    'æ̃', 'ʌ̃', 'ẽ', 'ẽː', 'õ', 'õː',
    'ø̃', 'øː', 'ø̃ː'
    'æː', 'æ̃ː', 'ʌː', 'ʌ̃ː', 'ɤ̃ː',
]
OPEN_ADJ_GUTR = {
    'æ': 'a', 'ʌ': 'a', 'æɪ̯': 'æɪ̯',
    'ei̯': 'æɪ̯', 'eĩ̯': 'æɪ̯̃',
    'æo̯': 'æo̯', 'øʊ̯': 'æo̯', 'øʊ̯̃': 'æõ̯',
    'ɑʊ̯': 'ɑʊ̯', 'ou̯': 'ɑʊ̯', 'oũ̯': 'ɑʊ̯̃',
    'ɑe̯': 'ɑe̯', 'ɤɪ̯': 'ɑe̯', 'ɤɪ̯̃': 'ɑẽ̯',
    'uɪ̯': 'ɤɪ̯', 'uɪ̯̃': 'ɤɪ̯̃',
    'ɛ': 'æ', 'ɛ̃': 'æ̃', 'ɛː': 'æː', 
    'ɔ': 'ʌ', 'ɔ̃': 'ʌ̃', 'ɔː': 'ʌː',
    'eɐ̯': 'æː', 'eɐ̯̃': 'ɛ̃ː',
    'oɐ̯': 'ʌː', 'oɐ̯̃': 'ɔ̃ː',
    'e': 'ɛ', 'eː': 'ɛː',
    'ø': 'æ',
    'o': 'ɔ', 'oː': 'ɔː',
    'ɤ': 'ʌ', 'ɤː': 'ʌː',
    'i': 'e', 'iː': 'eː', 'ie̯': 'eɐ̯',
    'ĩ': 'ẽ', 'ĩː': 'ẽː',
    'u': 'o', 'uː': 'oː', 'uo̯': 'oɐ̯',
    'ũ': 'õ', 'ũː': 'õː',
    'y': 'ø', 'yː': 'øː',
    'ỹ': 'ø̃', 'ỹː': 'ø̃ː',
}
OPEN_BEF_GUTR = {
    'æɪ̯': 'æː', 'æɪ̯̃': 'æ̃ː',
    'ɑe̯': 'ʌː', 'ɑẽ̯': 'ʌ̃ː',
    'ɤɪ̯': 'ɤː', 'ɤɪ̯̃': 'ɤ̃ː',
    'eː': 'eɐ̯', 'ẽː': 'eɐ̯̃',
    'oː': 'oɐ̯', 'õː': 'oɐ̯̃',
}
SHIFT_RARE_SOUND = {
    'ɥ': 'j', 'ʝ': 'j',
}

FINAL_VOWELS = {
    'a': ['â', 'á'], # Central
    'æ': ['a', 'à'], 'ɛ': ['e', 'è'], # Low front
    'e': ['ê', 'é'], 'ø': ['ø', 'ǿ'], # Mid front
    'i': ['i', 'í'], 'y': ['y', 'ý'], # High front
    'eɐ̯': ['ea', 'éa'], 'ie̯': ['ie', 'íe'], # Centring front
    'æɪ̯': ['æi', 'ǽi'], 'ei̯': ['ei', 'éi'], # Cis front
    'æo̯': ['æo', 'ǽo'], 'øʊ̯': ['øu', 'ǿu'], # Trans front
    'ʌ': ['å', 'ǻ'], 'ɔ': ['o', 'ò'], # Low back
    'o': ['ô', 'ó'], 'ɤ': ['ə', 'ə́'], # Mid back
    'u': ['u', 'ú'], 'uɪ̯': ['ui', 'úi'], # High back
    'oɐ̯': ['oa', 'óa'], 'uo̯': ['uo', 'úo'], # Centring back
    'ɑʊ̯': ['ɑu', 'ɑ́u'], 'ou̯': ['ou', 'óu'], # Cis back
    'ɑe̯': ['ɑe', 'ɑ́e'], 'ɤɪ̯': ['ɤi', 'ɤ́i'], # Trans back
}

FINAL_CONS = {
    'p': 'p', 'b': 'b', 'f': 'f', 'ʋ': 'v', 'm': 'm', 'm̥': 'm',
    't': 't', 'd': 'd', 's': 's', 'z': 'z', 'n': 'n', 'n̥': 'n',
    't͡ʃ': 'ť', 'd͡ʒ': 'ď', 'r': 'r', 'r̥': 'r̥', 'ɹ': 'ɹ', 'l': 'l',
    'c': 'c', 'ɟ': 'ǵ', 'c͡ɕ': 'č', 'ɟ͡ʑ': 'y̌',
    'ɕ': 'ś', 'ʑ': 'ź', 'ɲ': 'ń', 'ɲ̊': 'ń', 'ʎ': 'ľ', 'j': 'j',
    'k': 'k', 'g': 'g', 'x': 'x', 'ɣ': 'w',  
    'ɢ': 'q', 'ħ': 'h', 'ɴ': 'ñ', 'ɴ̥': 'ñ', 'ʔ': 'ʔ',
}

# Alternate romanisation
# FINAL_VOWELS = {
#     'a': ['ä', 'ā'], # Central
#     'æ': ['a', 'à'], 'ɛ': ['e', 'è'], # Low front
#     'e': ['ê', 'é'], 'ø': ['ö', 'ő'], # Mid front
#     'i': ['i', 'í'], 'y': ['ü', 'ű'], # High front
#     'eɐ̯': ['ea', 'éa'], 'ie̯': ['ie', 'íe'], # Centring front
#     'æɪ̯': ['ai', 'ái'], 'ei̯': ['ei', 'éi'], # Cis front
#     'æo̯': ['ao', 'áo'], 'øʊ̯': ['eu', 'éu'], # Trans front
#     'ʌ': ['â', 'á'], 'ɔ': ['o', 'ò'], # Low back
#     'o': ['ô', 'ó'], 'ɤ': ['ë', 'e̋'], # Mid back
#     'u': ['u', 'ú'], 'uɪ̯': ['ui', 'úi'], # High back
#     'oɐ̯': ['oa', 'óa'], 'uo̯': ['uo', 'úo'], # Centring back
#     'ɑʊ̯': ['au', 'áu'], 'ou̯': ['ou', 'óu'], # Cis back
#     'ɑe̯': ['ae', 'áe'], 'ɤɪ̯': ['oi', 'ói'], # Trans back
# }

# FINAL_CONS = {
#     'p': 'p', 'b': 'b', 'f': 'f', 'ʋ': 'v', 'm': 'm', 'm̥': 'm',
#     't': 't', 'd': 'd', 's': 's', 'z': 'z', 'n': 'n', 'n̥': 'n',
#     't͡ʃ': 'ť', 'd͡ʒ': 'ď', 'r': 'r', 'r̥': 'ŕ', 'ɹ': 'ř', 'l': 'l',
#     'c': 'c', 'ɟ': 'y', 'c͡ɕ': 'č', 'ɟ͡ʑ': 'y̌',
#     'ɕ': 'ś', 'ʑ': 'ź', 'ɲ': 'ń', 'ɲ̊': 'ń', 'ʎ': 'ľ', 'j': 'j',
#     'k': 'k', 'g': 'g', 'x': 'x', 'ɣ': 'w',  
#     'ɢ': 'q', 'ħ': 'h', 'ɴ': 'ñ', 'ɴ̥': 'ñ', 'ʔ': 'ʔ',
# }
